#ifndef _DECARDMINIPAY_H_
#define _DECARDMINIPAY_H_

#ifdef __cplusplus
extern "C" {
#endif

/*************************************************************************** 
** 函数名称:  GetTerminalStatus();  
** 功能描述:  获取迷你付终端设备状态
** 输入参数:  无
** 输出参数:  无               
** 返 回 值:  1 => 设备插入
              2 => 设备拔出
			  3 => 设备存在
			  4 => 设备不存在
			 其它值 => 未知错误
**--------------------------------------------------------------------------         
** 函数创建者:        
** 创建日期:      
**-------------------------------------------------------------------------- 
** 最后修改者:       
** 修改日期:     
** 修改原因:      
**-------------------------------------------------------------------------- 
** 备注:            
***************************************************************************/
_declspec(dllexport)	DWORD GetTerminalStatus(); 

/*************************************************************************** 
** 函数名称:  Init();  
** 功能描述:  初始化证书存储区数据，清空所有证书数据，
** 输入参数:  无
** 输出参数:  无               
** 返 回 值:  TRUE  => 成功
              FALSE => 失败
**--------------------------------------------------------------------------         
** 函数创建者:        
** 创建日期:      
**-------------------------------------------------------------------------- 
** 最后修改者:       
** 修改日期:     
** 修改原因:      
**-------------------------------------------------------------------------- 
** 备注: 该命令会擦除包括终端、CA和Pin在内的所有的证书数据和公私密钥对，初次导入证书前要，要执行该命令，
**       清空所有与证书有关的数据，以便导入新的证书。
***************************************************************************/
_declspec(dllexport)	BOOL  Init();

/*************************************************************************** 
** 函数名称:  SetTerminalID(unsigned char *pInBuf, DWORD InLength);  
** 功能描述:  设置终端ID号
** 输入参数:  
**             pInBuf : 需要写入的数据
**            InLength: 需要写入数据的长度
** 输出参数:  无               
** 返 回 值:  TRUE  => 成功
              FALSE => 失败
**--------------------------------------------------------------------------         
** 函数创建者:        
** 创建日期:      
**-------------------------------------------------------------------------- 
** 最后修改者:       
** 修改日期:     
** 修改原因:      
**-------------------------------------------------------------------------- 
** 备注：    应为ID号正常为23字节，函数中限定了输入长度为23个字节,否则设置不成功
***************************************************************************/
_declspec(dllexport)	BOOL  SetTerminalID(unsigned char *pInBuf, DWORD InLength); 

/*************************************************************************** 
** 函数名称:  GetTerminalID(unsigned char *pOutBuf, DWORD * pOutLength);  
** 功能描述:  读取终端ID号
** 输入参数:  
**            pOutBuf : 读取的数据
**            pOutLength: 读取的长度
** 输出参数:  无               
** 返 回 值:  TRUE  => 成功
              FALSE => 失败
**--------------------------------------------------------------------------         
** 函数创建者:        
** 创建日期:      
**-------------------------------------------------------------------------- 
** 最后修改者:       
** 修改日期:     
** 修改原因:      
**-------------------------------------------------------------------------- 
***************************************************************************/
_declspec(dllexport)	BOOL  GetTerminalID(unsigned char *pOutBuf, DWORD * pOutLength); 

/*************************************************************************** 
** 函数名称:  AddCert(DWORD dwCertType, BYTE *pInBuf, DWORD InLength);
** 功能描述:  终端添加证书数据
** 输入参数:  
**             dwCertType :  证书索引值
**                          1 => CA证书索引
**                          2 => Pin证书索引
**                          其它值 => 非法索引

**             pInBuf : 需要写入的证书数据
**            InLength: 需要写入的证书数据长度
** 输出参数:  无               
** 返 回 值:  TRUE  => 成功
              FALSE => 失败
**--------------------------------------------------------------------------         
** 函数创建者:        
** 创建日期:      
**-------------------------------------------------------------------------- 
** 最后修改者:       
** 修改日期:     
** 修改原因:      
**-------------------------------------------------------------------------- 
***************************************************************************/
_declspec(dllexport)	BOOL  AddCert(DWORD dwCertType, BYTE *pInBuf, DWORD InLength);

#ifdef __cplusplus
}
#endif
#endif

/*******************************************************************************
**                            End Of File                                     **
**          (C) Copyright ShenZhen Decard SmartCard Tech co.,LTD              **
*******************************************************************************/











